scripts/dev/cold_plate/channel_verification/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Parallel-plate channel: length L, gap H, one cell thick (2D).
// NX and NY are substituted by run_case.sh.
scale 0.001;  // millimetres

vertices
(
    (0 0 0) (100 0 0) (100 1 0) (0 1 0)
    (0 0 0.1) (100 0 0.1) (100 1 0.1) (0 1 0.1)
);

blocks ( hex (0 1 2 3 4 5 6 7) (NX NY 1) simpleGrading (1 1 1) );

boundary
(
    inlet  { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    walls  { type wall;  faces ((0 1 5 4) (3 7 6 2)); }
    frontAndBack { type empty; faces ((0 3 2 1) (4 5 6 7)); }
);
