scripts/dev/cold_plate/channel_verification/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;
nu              1e-06;  // water, m^2/s
