scripts/dev/cold_plate/channel_verification/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p { solver GAMG; smoother GaussSeidel; tolerance 1e-12; relTol 0.01; }
    U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-12; relTol 0.01; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    residualControl { p 1e-9; U 1e-10; }
}
relaxationFactors { equations { U 0.9; } }
